`timescale 1ns / 1ps

module tb_multiplexer();
    reg [3:0] d0, d1, d2, d3, d4, d5, d6, d7;
    reg a2, a1, a0;
    wire [3:0] q;

    // Ініціалізація модуля
    multiplexer_8to1_4bit uut (
        .D0(d0), .D1(d1), .D2(d2), .D3(d3), 
        .D4(d4), .D5(d5), .D6(d6), .D7(d7),
        .A2(a2), .A1(a1), .A0(a0),
        .Q(q)
    );

    initial begin
        // Задаємо унікальні значення для кожного входу
        d0 = 4'h0; d1 = 4'h1; d2 = 4'h2; d3 = 4'h3;
        d4 = 4'h4; d5 = 4'h5; d6 = 4'h6; d7 = 4'h7;

        // Перебираємо всі комбінації адресних входів
        {a2, a1, a0} = 3'b000; #10; // Очікуємо Q = 0
        {a2, a1, a0} = 3'b001; #10; // Очікуємо Q = 1
        {a2, a1, a0} = 3'b010; #10; // Очікуємо Q = 2
        {a2, a1, a0} = 3'b011; #10; // Очікуємо Q = 3
        {a2, a1, a0} = 3'b100; #10; // Очікуємо Q = 4
        {a2, a1, a0} = 3'b101; #10; // Очікуємо Q = 5
        {a2, a1, a0} = 3'b110; #10; // Очікуємо Q = 6
        {a2, a1, a0} = 3'b111; #10; // Очікуємо Q = 7

        $stop; // Зупинка симуляції
    end
endmodule
